//Function：滤波和图像平滑的主入口
//Source:
//Status:
//Improve:
//Info:[11/16/2014 jmy]

#include "filtersmooth.h"
#include <stdio.h>

int filter(char*filename)
{

	//-----------------------------------【逆向滤波】------------------------------
	//	描述:来自于网络，暂时未调通
	//-------------------------------------------------------------------------
	//backwards();
    
	//---------------------------【opencv2.0演示滤波】------------------------------
	//	描述:包含方框、中值和高斯滤波
	//-------------------------------------------------------------------------
	opencv2_filter(filename);

	//-----------------------------------【线性滤波】------------------------------
    //	描述:来自浅墨，包含方框，均值和高斯滤波,tarackbar调节内核参数
    //-------------------------------------------------------------------------
	//linear_filter(filename);

	//-------------------------------【线性和非线性滤波】------------------------------
	//	描述:来自浅墨，包含线性（方框，均值和高斯）和非线性（中值和双边），tarackbar调节内核参数
	//-------------------------------------------------------------------------
	//filter_whole(filename);

	
	getchar();
	return 0;
}