#include "detection.h"
#include <opencv2/core/core.hpp>
#include <opencv2/highgui/highgui.hpp>
#include <opencv2/imgproc/imgproc.hpp>

using namespace cv;


int main(int argc, char* argv[])
{
	IplImage *src=cvLoadImage("video_12.JPG");
	char*filename="samples/test.jpg";
	//-------------------------------¡¾±ßÔµ¼ì²â¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
	//canny(filename);
	//log(filename);
	//sobel(filename);
	//prewitt(filename);
	//roberts(filename);
	//krisch(filename);
	//susan(filename);
	//laplace(filename);
	//laplace_mat(filename);
	canny_trackbar(filename);
	//edge_trackbar(filename);

	//-------------------------------¡¾Ö±Ïß¼ì²â¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
	//stdhoughlinedete(filename);
	//line_dete_2(filename);

	//-------------------------------¡¾Ô²¼ì²â¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
	//hough_circle(filename);
	
	//------------------------------¡¾¾ØÐÎ¼ì²â¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
    //square_detection();

	
	//-------------------------------¡¾ÂÖÀª¼ì²â¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
	//contour1();
	//contour2(filename);
	//contour4();

	//--------------------------------¡¾¶þÖµ»¯¡¿------------------------------
	//	ÃèÊö:
	//-------------------------------------------------------------------------
	//binaryzation(filename);
	//adaptiveThreshold(filename);


	//-----------------------------------¡¾Í¼ÏñÂË²¨ºÍÆ½»¬¡¿-----------------------------
	//ÃèÊö£º
	//-------------------------------------------------------------------------
	//meanshift_smooth_segmentation();
	
	
	return 0;
}
