/************************************************************************
* Copyright(c) 2015 tuling56
*
* File:	main.cpp
* Brief: 检测函数的主入口，测试集成功能时使用
* Source:
* Status: 
* Date:	[3/7/2015 jmy]
************************************************************************/

#include "detection.h"
#include <opencv2/core/core.hpp>
#include <opencv2/highgui/highgui.hpp>
#include <opencv2/imgproc/imgproc.hpp>

using namespace cv;


int main_(int argc, char* argv[])
{
	IplImage *src=cvLoadImage("video_12.JPG");
	char*filename="samples/grabCut.png";
	//-------------------------------【边缘检测】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
	//canny(filename);
	//log(filename);
	//sobel(filename);
	//prewitt(filename);
	//roberts(filename);
	//krisch(filename);
	//susan(filename);
	//laplace(filename);
	//laplace_mat(filename);
	//canny_trackbar(filename);
	//edge_trackbar(filename);

	//-------------------------------【直线检测】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
	//stdhoughlinedete(filename);
	//line_dete_2(filename);

	//-------------------------------【圆检测】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
	//hough_circle(filename);
	
	//------------------------------【矩形检测】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
    //square_detection();

	
	//-------------------------------【轮廓检测】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
	//contour1();
	//contour2(filename);
	//contour4();

	//--------------------------------【二值化】------------------------------
	//	描述:
	//-------------------------------------------------------------------------
	//binaryzation(filename);
	//adaptiveThreshold(filename);


	//-----------------------------------【图像分割】-----------------------------
	//描述：
	//-------------------------------------------------------------------------
	//meanshift_smooth_segmentation();//该函数里含有特殊的平滑成分
	
	
	return 0;
}
